import { memo, FC } from "react";
import { Image } from "antd";

import Shop from "../../assets/images/shop.jpg";
import Actors from "../../assets/images/actors.jpg";

import "./AboutUs.css";

const AboutUs: FC = memo(() => {
  return (
    <div className="info">
      <div>
        <p>
          <b>Книгарня Блека</b> (англ. Black Books) — британський ситком,
          створений Діланом Мораном і Грехемом Лайнеханом на замовлення
          телеканалу Channel 4. Телесеріал складається з 3 сезонів, кожен по 6
          епізодів довжиною в 22 хвилини. Перший сезон стартував 29 вересня 2000
          року. Двічі серіал здобув премію BAFTA в номінації «Найкраща
          ситуаційна комедія».
        </p>

        <Image src={Shop} className="imgs" alt="Shop" />
      </div>

      <div>
        <p>
          Назва серіалу походить від назви книжкової крамниці в інтелектуальному
          районі Лондона - Блумсбері. Власник книгарні - Бернард Блек (Ділан
          Моран) - дивний ірландець-мізантроп схильний до алкоголізму. Також в
          головних ролях Блеків помічник Менні (Біл Бейлі) та стара знайома
          Франческа (Темзін Ґреґ), яка працює по сусідству.
        </p>
      </div>

      <div>
        <p id="publishing-title">
          <b>Синопсис</b>
        </p>

        <p>
          Дії серіалу відбуваються в одній із лондонських книгарень, чий власник
          - екстравагантний соціофоб та мізантроп - ірландець Бернард Блек, який
          ненавидить всіх своїх клієнтів. Атмосфера ж в книгарні повністю
          підкреслює його нонконформізм: розкидані довкола книги, не мають
          ніякої упорядкованості, багато з них просто валяються на підлозі.
          Також в серіалі присутньо багато смішних моментів, основою для яких
          стає алкоголізм Блека, який в кожній серії вживає спиртні напої та
          палить. Власник книгарні постійно дозволяє собі в грубій формі
          розмовляти з покупцями, він нехтує всіма етикетними нормами, у своїй
          звичайній ексцентричній і дотепній манері розмовляє з ними, або навіть
          виганяє. Він не хоче продавати книги, так як замовляти нові дуже важко
          і нудно.
        </p>

        <Image src={Actors} className="imgs" alt="Actors" />
      </div>
      <div>
        <p>
          В крамниці також працює Блеків помічник, в цілому тямущий, але
          незграбний хлопець Менні. Він має більш поступливий та веселий
          характер, намагається вгодити Блеку, хоча це й не часто в нього
          виходить. Бернард і Менні - екстраверт та інтроверт - вони різні, хоча
          один без одного не можуть.
        </p>

        <p>
          Час від часу до книгарні Блека заходить давня подруга Блека Френ -
          єдина хто здатен хоч якось впливати на своєрідного Блека.
        </p>
      </div>
    </div>
  );
});

export default AboutUs;
